In [1]:
import pandas as pd

In [2]:
d={"Item":["apple","banana","papaya"],
  "Price":[100,200,300],
  "Quantity":[4,2,6]}
df1=pd.DataFrame(d)
print(df1)

     Item  Price  Quantity
0   apple    100         4
1  banana    200         2
2  papaya    300         6

In [5]:
df2=df1.copy()

In [6]:
df2.loc[0,"Price"]=150
df2.loc[2,"Price"]=250
df2.loc[0,"Quantity"]=5
df2.loc[2,"Quantity"]=4

In [7]:
df1.compare(df2)

   Price        Quantity
    self  other     self other
0  100.0  150.0      4.0   5.0
2  300.0  250.0      6.0   4.0

In [9]:
df1.compare(df2,align_axis=0)

         Price  Quantity
0 self   100.0       4.0
  other  150.0       5.0
2 self   300.0       6.0
  other  250.0       4.0

In [10]:
df1.compare(df2,keep_shape=True)

  Item        Price        Quantity
  self other   self  other     self other
0  NaN   NaN  100.0  150.0      4.0   5.0
1  NaN   NaN    NaN    NaN      NaN   NaN
2  NaN   NaN  300.0  250.0      6.0   4.0

In [11]:
df1.compare(df2,keep_equal=True)

  Price       Quantity
   self other     self other
0   100   150        4     5
2   300   250        6     4

In [12]:
df2.loc[0,"Item"]="orange"

In [13]:
df1.compare(df2,keep_equal=True)

     Item         Price       Quantity
     self   other  self other     self other
0   apple  orange   100   150        4     5
2  papaya  papaya   300   250        6     4

In [14]:
df1.compare(df2)

    Item          Price        Quantity
    self   other   self  other     self other
0  apple  orange  100.0  150.0      4.0   5.0
2    NaN     NaN  300.0  250.0      6.0   4.0